# Jacob Sheehan
## Week 13 11/14/2024
### Python - Pandas DataFrame - Mapping, Applying, Grouping, Plotting

In [1]:
import numpy as np
from pandas import *
import pandas as pd

In [2]:
df = DataFrame({'city':['Alma', 'Brian Head', 'Fox Park', 'Lake Mary'],
                   'altitude':[10355,9800,9062,8966]})
df

         city  altitude
0        Alma     10355
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [3]:
st_map = {'Alma':'Colorado','Brian Head':'Utah','Fox Park':'Wyoming',
             'Lake Mary': 'California'}
st_map

{'Alma': 'Colorado',
 'Brian Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [4]:
#map()
df['State'] = df['city'].map(st_map)
df

         city  altitude       State
0        Alma     10355    Colorado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [5]:
#apply
df1 = df.copy()
def meter(x):
    return x / 3.2808

In [6]:
df['altitude'] = df['altitude'].apply(meter)
df

         city     altitude       State
0        Alma  3156.242380    Colorado
1  Brian Head  2987.076323        Utah
2    Fox Park  2762.131188     Wyoming
3   Lake Mary  2732.870032  California

In [7]:
df1['altitude'] = df1['altitude'].apply(lambda x: x / 3.2808)
df1

         city     altitude       State
0        Alma  3156.242380    Colorado
1  Brian Head  2987.076323        Utah
2    Fox Park  2762.131188     Wyoming
3   Lake Mary  2732.870032  California

In [8]:
df['altitude'] = df['altitude'].apply(lambda x: np.nan if x < 2800 else x)
df

         city     altitude       State
0        Alma  3156.242380    Colorado
1  Brian Head  2987.076323        Utah
2    Fox Park          NaN     Wyoming
3   Lake Mary          NaN  California

In [9]:
df = DataFrame(np.random.randn(4,3), columns=list('bde'), index=['UT', 'OH', 'TX', 'OR'])
df

           b         d         e
UT -0.880951  0.018636 -0.300760
OH  0.660171 -0.507539  0.364305
TX  1.243950  0.309555 -1.835202
OR -0.905721  1.361651  1.028461

In [13]:
def dif(x):
    return x.max() - x.min()

In [14]:
x.apply(dif)

NameError: name 'x' is not defined

In [12]:
df.apply(lambda x:x.max() - x.min(), axis=1)

UT    0.899587
OH    1.167710
TX    3.079152
OR    2.267372
dtype: float64

In [15]:
df.apply(pd.value_counts)

             b    d    e
-1.835202  NaN  NaN  1.0
-0.905721  1.0  NaN  NaN
-0.880951  1.0  NaN  NaN
-0.507539  NaN  1.0  NaN
-0.300760  NaN  NaN  1.0
 0.018636  NaN  1.0  NaN
 0.309555  NaN  1.0  NaN
 0.364305  NaN  NaN  1.0
 0.660171  1.0  NaN  NaN
 1.028461  NaN  NaN  1.0
 1.243950  1.0  NaN  NaN
 1.361651  NaN  1.0  NaN

In [16]:
df.apply(pd.value_counts).fillna(0)

             b    d    e
-1.835202  0.0  0.0  1.0
-0.905721  1.0  0.0  0.0
-0.880951  1.0  0.0  0.0
-0.507539  0.0  1.0  0.0
-0.300760  0.0  0.0  1.0
 0.018636  0.0  1.0  0.0
 0.309555  0.0  1.0  0.0
 0.364305  0.0  0.0  1.0
 0.660171  1.0  0.0  0.0
 1.028461  0.0  0.0  1.0
 1.243950  1.0  0.0  0.0
 1.361651  0.0  1.0  0.0

In [18]:
df.apply(pd.value_counts,axis=1).fillna(0).astype(int)

,-1.835202,-0.905721,-0.880951,-0.507539,-0.300760,0.018636,0.309555,0.364305,0.660171,1.028461,1.243950,1.361651
UT,0,0,1,0,1,1,0,0,0,0,0,0
OH,0,0,0,1,0,0,0,1,1,0,0,0
TX,1,0,0,0,0,0,1,0,0,0,1,0
OR,0,1,0,0,0,0,0,0,0,1,0,1

In [20]:
# groupby
# It is the most frequently used Pandas function in data analysis
# Grouping the data points (i.e. row) based on the distinct values in the given column or columns
cars = ['Toyota', 'Ford', 'GMC', 'Dodge', 'BMW']

df = DataFrame({'brand': np.random.choice(cars, size=20),
               'price':np.random.randint(40000, 65000, size=20)})
df

     brand  price
0    Dodge  64651
1      BMW  56013
2   Toyota  50638
3      GMC  56925
4      BMW  59508
5      BMW  53095
6     Ford  58586
7    Dodge  54534
8      BMW  61843
9      GMC  41336
10     BMW  62575
11   Dodge  48843
12   Dodge  63508
13  Toyota  62177
14    Ford  52484
15     BMW  52719
16     BMW  46000
17     BMW  51900
18   Dodge  58276
19    Ford  50241

In [21]:
df.groupby('brand').sum() #sum price for brand

         price
brand
BMW     443653
Dodge   289812
Ford    161311
GMC      98261
Toyota  112815

In [22]:
df.groupby('brand').count() #count how many per brand

        price
brand
BMW         8
Dodge       5
Ford        3
GMC         2
Toyota      2

In [24]:
df.groupby('brand')['price'].mean() #series

               price
brand
BMW     55456.625000
Dodge   57962.400000
Ford    53770.333333
GMC     49130.500000
Toyota  56407.500000

In [26]:
df.groupby('brand')[['price']].mean() #dataframe

               price
brand
BMW     55456.625000
Dodge   57962.400000
Ford    53770.333333
GMC     49130.500000
Toyota  56407.500000

In [27]:
df['price'].groupby(df['brand']).sum()

brand
BMW       443653
Dodge     289812
Ford      161311
GMC        98261
Toyota    112815
Name: price, dtype: int32

In [28]:
type(df['price'].groupby(df['brand']).sum())

pandas.core.series.Series

In [31]:
#cumilative sum
df['cum_sum'] = df.groupby('brand')['price'].cumsum()
df

     brand  price  cum_sum
0    Dodge  64651    64651
1      BMW  56013    56013
2   Toyota  50638    50638
3      GMC  56925    56925
4      BMW  59508   115521
5      BMW  53095   168616
6     Ford  58586    58586
7    Dodge  54534   119185
8      BMW  61843   230459
9      GMC  41336    98261
10     BMW  62575   293034
11   Dodge  48843   168028
12   Dodge  63508   231536
13  Toyota  62177   112815
14    Ford  52484   111070
15     BMW  52719   345753
16     BMW  46000   391753
17     BMW  51900   443653
18   Dodge  58276   289812
19    Ford  50241   161311

In [33]:
df.sort_values(by=['brand', 'price'])

     brand  price  cum_sum
16     BMW  46000   391753
17     BMW  51900   443653
15     BMW  52719   345753
5      BMW  53095   168616
1      BMW  56013    56013
4      BMW  59508   115521
8      BMW  61843   230459
10     BMW  62575   293034
11   Dodge  48843   168028
7    Dodge  54534   119185
18   Dodge  58276   289812
12   Dodge  63508   231536
0    Dodge  64651    64651
19    Ford  50241   161311
14    Ford  52484   111070
6     Ford  58586    58586
9      GMC  41336    98261
3      GMC  56925    56925
2   Toyota  50638    50638
13  Toyota  62177   112815

In [35]:
#groupby using two columns
sample1=list('abcd')
sample2=['one','two','three','four']

df = DataFrame({
    'k1': np.random.choice(sample1, size = 40),
    'k2': np.random.choice(sample2, size = 40),
    'dataset1':np.random.randn(40) * 10,
    'dataset2':np.random.randn(40) * 15,

})
df

   k1     k2   dataset1   dataset2
0   d  three  -9.034895  -1.319622
1   b  three   2.847286  12.588893
2   a    two  19.747309   0.922891
3   c  three -11.088116   7.155819
4   b  three  14.671094  12.183944
5   d   four  -1.830856  20.328597
6   b    two  -6.583801 -19.083507
7   c    one -19.348994 -21.159393
8   b   four  -9.040271  11.509841
9   c   four  18.152052  -4.757423
10  c    one  -8.010785 -23.337044
11  a    one   6.875331  29.070134
12  b  three  -5.911599  -0.749410
13  a    one  -3.823965  -1.490478
14  a   four   9.466595  11.738009
15  c   four  16.078578  -4.170986
16  a    one  12.957154  -6.375296
17  a  three  -4.300792  -9.775601
18  b    one   2.757922  -4.712453
19  a   four  -2.752766  -5.828903
20  b  three  16.919320 -15.843561
21  b  three  -3.372182   6.541848
22  b   four  -4.813547  12.763169
23  a  three  -1.506301 -36.908035
24  c    one -23.461586   3.536091
25  b   four   3.589826  12.653932
26  b   four   1.747859  -9.454376
27  b  three  13.829093   3.165507
28  b    one  -8.773511  -8.090042
29  d    one  20.210969   6.991843
30  a   four  -5.766071   9.399957
31  d    one   4.706015 -21.618224
32  a   four   0.329282  13.708827
33  d    one -17.286358   5.567624
34  b    one   5.442232  -8.757385
35  b    two  -0.102273   2.386430
36  a    two  -4.441790  -3.821496
37  c    one   4.235764  15.439112
38  d   four  -5.515487  -5.259494
39  a  three  -0.046580  -0.772099

In [36]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a   12        12        12
b   15        15        15
c    7         7         7
d    6         6         6

In [37]:
df.groupby('k1').sum()

     dataset1   dataset2
k1
a   26.737406  -0.132092
b   23.207448   7.102830
c  -23.443087 -27.293824
d   -8.750613   4.690723

In [38]:
df.groupby('k2').sum()

        dataset1   dataset2
k2
four   19.645193  62.631150
one   -23.519812 -34.935514
three  13.006328 -23.732317
two     8.619445 -19.595682

In [40]:
df.groupby(['k1','k2']).sum()

           dataset1   dataset2
k1 k2
a  four    1.277040  29.017890
   one    16.008520  21.204359
   three  -5.853673 -47.455735
   two    15.305519  -2.898605
b  four   -8.516133  27.472566
   one    -0.573357 -21.559881
   three  38.983012  17.887220
   two    -6.686074 -16.697076
c  four   34.230630  -8.928409
   one   -46.585601 -25.521234
   three -11.088116   7.155819
d  four   -7.346344  15.069103
   one     7.630626  -9.058757
   three  -9.034895  -1.319622

In [41]:
df.groupby(['k2','k1']).sum()

           dataset1   dataset2
k2    k1
four  a    1.277040  29.017890
      b   -8.516133  27.472566
      c   34.230630  -8.928409
      d   -7.346344  15.069103
one   a   16.008520  21.204359
      b   -0.573357 -21.559881
      c  -46.585601 -25.521234
      d    7.630626  -9.058757
three a   -5.853673 -47.455735
      b   38.983012  17.887220
      c  -11.088116   7.155819
      d   -9.034895  -1.319622
two   a   15.305519  -2.898605
      b   -6.686074 -16.697076

In [45]:
df['dataset1'].groupby(df['k1']).sum() #series

k1
a    26.737406
b    23.207448
c   -23.443087
d    -8.750613
Name: dataset1, dtype: float64

In [46]:
df.groupby(['k1', 'k2'])[['dataset1']].sum()

           dataset1
k1 k2
a  four    1.277040
   one    16.008520
   three  -5.853673
   two    15.305519
b  four   -8.516133
   one    -0.573357
   three  38.983012
   two    -6.686074
c  four   34.230630
   one   -46.585601
   three -11.088116
d  four   -7.346344
   one     7.630626
   three  -9.034895

In [47]:
group1 = df.groupby(['k1', 'k2'])[['dataset1']]
group1

In [48]:
group1.mean()

           dataset1
k1 k2
a  four    0.319260
   one     5.336173
   three  -1.951224
   two     7.652760
b  four   -2.129033
   one    -0.191119
   three   6.497169
   two    -3.343037
c  four   17.115315
   one   -11.646400
   three -11.088116
d  four   -3.673172
   one     2.543542
   three  -9.034895

In [49]:
group1.cumsum()

     dataset1
0   -9.034895
1    2.847286
2   19.747309
3  -11.088116
4   17.518380
5   -1.830856
6   -6.583801
7  -19.348994
8   -9.040271
9   18.152052
10 -27.359779
11   6.875331
12  11.606781
13   3.051366
14   9.466595
15  34.230630
16  16.008520
17  -4.300792
18   2.757922
19   6.713829
20  28.526101
21  25.153919
22 -13.853818
23  -5.807093
24 -50.821365
25 -10.263992
26  -8.516133
27  38.983012
28  -6.015589
29  20.210969
30   0.947759
31  24.916984
32   1.277040
33   7.630626
34  -0.573357
35  -6.686074
36  15.305519
37 -46.585601
38  -7.346344
39  -5.853673